In [35]:
import pandas as pd
import numpy as np

In [3]:
# You can find this prolem using this link 
# https://www.kaggle.com/code/icarofreire/pandas-24-useful-exercises-with-solutions

In [4]:
list1 = list ("homeland")
arr1 = np.arange(1,10)
dict1 = {"A" : 0,"B" : 1,"C": 2,"D": 3, "E": 5}

In [7]:
series1 = pd.Series(list1)
series1

0    h
1    o
2    m
3    e
4    l
5    a
6    n
7    d
dtype: object

In [12]:
series2 = pd.Series(arr1, index=["col1","col2","col3","col4","col5","col6","col7","col8","col9"])
series2

col1    1
col2    2
col3    3
col4    4
col5    5
col6    6
col7    7
col8    8
col9    9
dtype: int64

In [14]:
series3 = pd.Series(dict1)
series3

A    0
B    1
C    2
D    3
E    5
dtype: int64

In [17]:
ser1 = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

In [27]:
ser_df = pd.DataFrame(ser1,ser2).reset_index()
ser_df.head()

   index  0
0      0  a
1      1  b
2      2  c
3      3  d
4      4  e

In [23]:
ser1.head()
ser_df = pd.DataFrame({"col1": ser1,"col2":ser2})
ser_df.head(5)

  col1  col2
0    a     0
1    b     1
2    c     2
3    d     3
4    e     4

In [38]:
ser3 = pd.Series([1,2,3,4,5,6,7])
ser4 = pd.Series([3,4,5,6,7,8,9])
ser4

0    3
1    4
2    5
3    6
4    7
5    8
6    9
dtype: int64

In [30]:
ser3[~ser3.isin(ser4)]

0    1
1    2
dtype: int64

In [31]:
ser4[~ser4.isin(ser3)]

5    8
6    9
dtype: int64

In [40]:
ser3_not_ser4 = ser3[~ser4.isin(ser3)]
ser4_not_ser3 = ser4[~ser3.isin(ser3)]
ser3_not_ser4.append(ser4_not_ser3, ignore_index =True)

AttributeError: 'Series' object has no attribute 'append'

In [42]:
state= np.random.RandomState(100)
ser = pd.Series(state.normal(10,5,25))

In [43]:
ser.describe()

count    25.000000
mean     10.435437
std       4.253118
min       1.251173
25%       7.709865
50%      10.922593
75%      13.363604
max      18.094908
dtype: float64

In [44]:
ser.value_counts()

1.251173     1
14.084235    1
5.787821     1
8.740604     1
17.708026    1
18.094908    1
4.408409     1
7.809322     1
15.148663    1
7.343598     1
9.477944     1
13.363604    1
7.082025     1
11.713402    1
12.175817    1
7.709865     1
11.275007    1
9.052521     1
4.649783     1
11.105898    1
12.571094    1
14.906604    1
8.737820     1
15.765179    1
10.922593    1
Name: count, dtype: int64

In [49]:
arr_np = pd.Series(np.random.randint(1,10,35))
arr_np

0     1
1     7
2     3
3     8
4     4
5     6
6     9
7     3
8     9
9     2
10    1
11    8
12    4
13    6
14    3
15    7
16    1
17    2
18    8
19    9
20    6
21    7
22    8
23    2
24    7
25    5
26    3
27    9
28    7
29    6
30    8
31    7
32    4
33    8
34    2
dtype: int64

In [53]:
pd.DataFrame(arr_np.values.reshape(7,5))

   0  1  2  3  4
0  1  7  3  8  4
1  6  9  3  9  2
2  1  8  4  6  3
3  7  1  2  8  9
4  6  7  8  2  7
5  5  3  9  7  6
6  8  7  4  8  2

In [56]:
salesDF = pd.read_csv("Dataset/5_Sales.csv")
salesDF

   SalesRep Region Month  Sales  Units Sold
0       Amy  North   Jan  23040         239
1       Amy  North   Feb  24131          79
2       Amy  North   Mar  24646          71
3       Amy  North   Apr  22047          71
4       Amy  North   May  24971          80
5       Amy  North   Jun  24218          92
6       Amy  North   Jul  25735         175
7       Amy  North   Aug  24678          87
8       Amy  North   Sep  25749         557
9       Amy  North   Oct  24437          95
10      Amy  North   Nov  25355         706
11      Amy  North   Dec  25899         180
12      Bob  North   Jan  20024         103
13      Bob  North   Feb  23822         267
14      Bob  North   Mar  24854          96
15      Bob  North   Apr  22838          74
16      Bob  North   May  25320         231
17      Bob  North   Jun  24733         164
18      Bob  North   Jul  21184          68
19      Bob  North   Aug  23174         114
20      Bob  North   Sep  25999          84
21      Bob  North   Oct  22639         260
22      Bob  North   Nov  23949         109
23      Bob  North   Dec  23179         465
24    Chuck  South   Jan  19886          95
25    Chuck  South   Feb  23494         148
26    Chuck  South   Mar  21824          83
27    Chuck  South   Apr  22058          96
28    Chuck  South   May  20280         453
29    Chuck  South   Jun  23965         760
30    Chuck  South   Jul  23032         155
31    Chuck  South   Aug  21273         769
32    Chuck  South   Sep  21584         114
33    Chuck  South   Oct  19625          83
34    Chuck  South   Nov  19832          70
35    Chuck  South   Dec  20583         178
36     Doug  South   Jan  26264          92
37     Doug  South   Feb  29953         852
38     Doug  South   Mar  25041          86
39     Doug  South   Apr  29338         223
40     Doug  South   May  25150         242
41     Doug  South   Jun  27371          95
42     Doug  South   Jul  25044          82
43     Doug  South   Aug  29506         103
44     Doug  South   Sep  29061         146
45     Doug  South   Oct  27113         120
46     Doug  South   Nov  25953          81
47     Doug  South   Dec  28670         198

In [57]:
salesDF.head(3)

  SalesRep Region Month  Sales  Units Sold
0      Amy  North   Jan  23040         239
1      Amy  North   Feb  24131          79
2      Amy  North   Mar  24646          71

In [60]:
salesDF[['Region','Sales']]

   Region  Sales
0   North  23040
1   North  24131
2   North  24646
3   North  22047
4   North  24971
5   North  24218
6   North  25735
7   North  24678
8   North  25749
9   North  24437
10  North  25355
11  North  25899
12  North  20024
13  North  23822
14  North  24854
15  North  22838
16  North  25320
17  North  24733
18  North  21184
19  North  23174
20  North  25999
21  North  22639
22  North  23949
23  North  23179
24  South  19886
25  South  23494
26  South  21824
27  South  22058
28  South  20280
29  South  23965
30  South  23032
31  South  21273
32  South  21584
33  South  19625
34  South  19832
35  South  20583
36  South  26264
37  South  29953
38  South  25041
39  South  29338
40  South  25150
41  South  27371
42  South  25044
43  South  29506
44  South  29061
45  South  27113
46  South  25953
47  South  28670

In [61]:
salesDF.iloc[[1,2,5,7,3,43],[1,3]]

   Region  Sales
1   North  24131
2   North  24646
5   North  24218
7   North  24678
3   North  22047
43  South  29506

In [66]:
salesDF[salesDF['Sales']>25000]

   SalesRep Region Month  Sales  Units Sold
6       Amy  North   Jul  25735         175
8       Amy  North   Sep  25749         557
10      Amy  North   Nov  25355         706
11      Amy  North   Dec  25899         180
16      Bob  North   May  25320         231
20      Bob  North   Sep  25999          84
36     Doug  South   Jan  26264          92
37     Doug  South   Feb  29953         852
38     Doug  South   Mar  25041          86
39     Doug  South   Apr  29338         223
40     Doug  South   May  25150         242
41     Doug  South   Jun  27371          95
42     Doug  South   Jul  25044          82
43     Doug  South   Aug  29506         103
44     Doug  South   Sep  29061         146
45     Doug  South   Oct  27113         120
46     Doug  South   Nov  25953          81
47     Doug  South   Dec  28670         198

In [76]:
print("Rowlen(salesDF.axes[0]))
print(len(salesDF.axes[1]))

48
5